import React from "react";
// images
import umumiyMalumot from "../../assets/images/umumiyM.png";
// components
import Sidebar from "../../components/sidebar/Sidebar";
import OqXalat from "./components/OqXalat";
import SmallContact from "./components/SmallContact";

function Umumiy() {
  return (
    <div className="umumiy">
      <div className="desc">
        <h1>UMUMIY MA’LUMOT</h1>
        <p>
          Ўзбекистон Республикаси Соғлиқни сақлаш вазирлиги (кейинчалик матнда
          Вазирлик) соғлиқни сақлаш бўйича марказий давлат бошқаруви ҳисобланиб,
          ўз фаолияти бўйича Ўзбекистон Республикаси Вазирлар Маҳкамасига
          бўйсунади. Вазирлик фаолиятини бошқа давлат идоралари, жумладан давлат
          муассасалари, Қорақалпоғистон Республикаси, вилоятлар ва Тошкент
          шаҳрининг ижро этувчи ҳокимият идоралари, шунингдек бошқа жамоатчилик
          ташкилотлари билан бирга олиб боради. Вазирлик фаолияти Ўзбекистон
          Республикаси Конституцияси, қонунлари, Ўзбекистон Республикаси Олий
          Мажлисининг бошқа расмий ҳужжатлари, Ўзбекистон Республикаси
          Президентининг буйруқ ва фармойишлари, Вазирлар Маҳкамасининг қарор ва
          буйруқлари, шунингдек бошқа қонуний ҳужжатлар, Ўзбекистон Республикаси
          билан соғлиқни сақлаш бўйича тузилган халқаро шартномалар, шунингдек
          ушбу Низом асосида юритилади.
        </p>
        <div className="image">
          <img src={umumiyMalumot} />
        </div>
        <p>
          Вазирлик ваколати доирасида чиқарилган меъёрий-ҳуқуқий ҳужжатлар
          ижроси давлат идоралари, корхоналари, муассасалари, ташкилотлари ва
          умуман Ўзбекистон Республикасида жойлашган мулкчилик шаклидан қаътий
          назар барча жамоатчилик бирлашмалари ва жисмоний шахслар учун
          мажбурийдир. Ўзбекистон Республикаси Соғлиқни сақлаш вазирлиги,
          Қорақалпоғистон Республикаси Соғлиқни сақлаш вазирлиги, вилоят ва
          Тошкент шаҳрида соғлиқни сақлаш бўйича фаолият олиб бораётган
          идоралар, уларнинг шаҳар ва туманлардаги бўлимлари республикада ягона
          соғлиқни сақлаш бошқарув идораси тизимини ташкил этади. Вазирлик
          юридик шахс бўлиб, ўзига тегишли мулкни, кирим – чиқим ҳаражатларини,
          банкдаги ҳисоб –китобларни бошқариш ва ўз номи, шунингдек Ўзбекистон
          Республикаси гербининг тасвири туширилган муҳрга эгалик қилиш ҳуқуқига
          эга.
        </p>
      </div>
      <div className="layout">
        <Sidebar />
        <OqXalat />
        <SmallContact />
      </div>
    </div>
  );
}

export default Umumiy;
